Revit 2024 API
HVACLoadType.LightingLoadDensity Property
 The lighting load density.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public double LightingLoadDensity { get; set; }
Visual Basic
Public Property LightingLoadDensity As Double
	Get
	Set
Visual C++
public:
property double LightingLoadDensity {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The value should be between [0.0,500000.0].
See Also
HVACLoadType Class
Autodesk.Revit.DB.Analysis Namespace